ycsb/logs/RDMA_BP_16_async_th_28/workloadc.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 16556949, 0.000000
[OVERALL], RunTime(ms), 5651
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17695.983011856308
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 54.97238
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5635
[READ], 95thPercentileLatency(us), 92
[READ], 99thPercentileLatency(us), 129
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4674.0
[CLEANUP], MinLatency(us), 4672
[CLEANUP], MaxLatency(us), 4675
[CLEANUP], 95thPercentileLatency(us), 4675
[CLEANUP], 99thPercentileLatency(us), 4675
total zerocopy send size = 0, total send size = 16543435, 0.000000
[OVERALL], RunTime(ms), 5797
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17250.301880282906
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 56.54543
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5231
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 129
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2259.0
[CLEANUP], MinLatency(us), 2258
[CLEANUP], MaxLatency(us), 2259
[CLEANUP], 95thPercentileLatency(us), 2259
[CLEANUP], 99thPercentileLatency(us), 2259
total zerocopy send size = 0, total send size = 16554917, 0.000000
[OVERALL], RunTime(ms), 5869
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17038.67779860283
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.23028
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5451
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 131
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4482.0
[CLEANUP], MinLatency(us), 4480
[CLEANUP], MaxLatency(us), 4483
[CLEANUP], 95thPercentileLatency(us), 4483
[CLEANUP], 99thPercentileLatency(us), 4483
total zerocopy send size = 0, total send size = 16546098, 0.000000
total zerocopy send size = 0, total send size = 16541130, 0.000000
total zerocopy send size = 0, total send size = 16538891, 0.000000
[OVERALL], RunTime(ms), 5864
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17053.20600272851
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.24485
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5275
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 132
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3359.0
[CLEANUP], MinLatency(us), 3358
[CLEANUP], MaxLatency(us), 3359
[CLEANUP], 95thPercentileLatency(us), 3359
[CLEANUP], 99thPercentileLatency(us), 3359
[OVERALL], RunTime(ms), 5886
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16989.466530750935
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.42642
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5271
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 131
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3135.0
[CLEANUP], MinLatency(us), 3134
[CLEANUP], MaxLatency(us), 3135
[CLEANUP], 95thPercentileLatency(us), 3135
[CLEANUP], 99thPercentileLatency(us), 3135
[OVERALL], RunTime(ms), 5889
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16980.811682798438
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.45412
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5419
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 132
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4118.0
[CLEANUP], MinLatency(us), 4116
[CLEANUP], MaxLatency(us), 4119
[CLEANUP], 95thPercentileLatency(us), 4119
[CLEANUP], 99thPercentileLatency(us), 4119
total zerocopy send size = 0, total send size = 16559144, 0.000000
total zerocopy send size = 0, total send size = 16538320, 0.000000
[OVERALL], RunTime(ms), 5914
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16909.029421711195
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.77403
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5879
[READ], 95thPercentileLatency(us), 96
[READ], 99thPercentileLatency(us), 139
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2111.0
[CLEANUP], MinLatency(us), 2110
[CLEANUP], MaxLatency(us), 2111
[CLEANUP], 95thPercentileLatency(us), 2111
[CLEANUP], 99thPercentileLatency(us), 2111
[OVERALL], RunTime(ms), 5926
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16874.789065136687
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.92207
[READ], MinLatency(us), 27
[READ], MaxLatency(us), 5471
[READ], 95thPercentileLatency(us), 95
[READ], 99thPercentileLatency(us), 132
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2023.0
[CLEANUP], MinLatency(us), 2023
[CLEANUP], MaxLatency(us), 2023
[CLEANUP], 95thPercentileLatency(us), 2023
[CLEANUP], 99thPercentileLatency(us), 2023
total zerocopy send size = 0, total send size = 16554932, 0.000000
total zerocopy send size = 0, total send size = 16549773, 0.000000
total zerocopy send size = 0, total send size = 16568934, 0.000000
[OVERALL], RunTime(ms), 5945
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16820.85786375105
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 58.07597
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5955
[READ], 95thPercentileLatency(us), 97
[READ], 99thPercentileLatency(us), 133
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2011.0
[CLEANUP], MinLatency(us), 2011
[CLEANUP], MaxLatency(us), 2011
[CLEANUP], 95thPercentileLatency(us), 2011
[CLEANUP], 99thPercentileLatency(us), 2011
[OVERALL], RunTime(ms), 5923
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16883.33614722269
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 57.85816
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5699
[READ], 95thPercentileLatency(us), 98
[READ], 99thPercentileLatency(us), 141
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1930.0
[CLEANUP], MinLatency(us), 1930
[CLEANUP], MaxLatency(us), 1930
[CLEANUP], 95thPercentileLatency(us), 1930
[CLEANUP], 99thPercentileLatency(us), 1930
[OVERALL], RunTime(ms), 5977
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16730.80140538732
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 58.32758
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5307
[READ], 95thPercentileLatency(us), 97
[READ], 99thPercentileLatency(us), 133
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1923.0
[CLEANUP], MinLatency(us), 1923
[CLEANUP], MaxLatency(us), 1923
[CLEANUP], 95thPercentileLatency(us), 1923
[CLEANUP], 99thPercentileLatency(us), 1923
total zerocopy send size = 0, total send size = 16574961, 0.000000
total zerocopy send size = 0, total send size = 16541482, 0.000000
[OVERALL], RunTime(ms), 6006
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16650.01665001665
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 58.64607
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5271
[READ], 95thPercentileLatency(us), 96
[READ], 99thPercentileLatency(us), 135
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2131.0
[CLEANUP], MinLatency(us), 2130
[CLEANUP], MaxLatency(us), 2131
[CLEANUP], 95thPercentileLatency(us), 2131
[CLEANUP], 99thPercentileLatency(us), 2131
total zerocopy send size = 0, total send size = 16573138, 0.000000
[OVERALL], RunTime(ms), 6038
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16561.775422325274
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 58.95769
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5243
[READ], 95thPercentileLatency(us), 98
[READ], 99thPercentileLatency(us), 133
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2075.0
[CLEANUP], MinLatency(us), 2074
[CLEANUP], MaxLatency(us), 2075
[CLEANUP], 95thPercentileLatency(us), 2075
[CLEANUP], 99thPercentileLatency(us), 2075
total zerocopy send size = 0, total send size = 16538268, 0.000000
[OVERALL], RunTime(ms), 6031
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16580.9981760902
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 58.87034
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5455
[READ], 95thPercentileLatency(us), 99
[READ], 99thPercentileLatency(us), 134
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2335.0
[CLEANUP], MinLatency(us), 2334
[CLEANUP], MaxLatency(us), 2335
[CLEANUP], 95thPercentileLatency(us), 2335
[CLEANUP], 99thPercentileLatency(us), 2335
[OVERALL], RunTime(ms), 6065
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16488.046166529268
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 59.17517
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5327
[READ], 95thPercentileLatency(us), 99
[READ], 99thPercentileLatency(us), 135
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1891.0
[CLEANUP], MinLatency(us), 1891
[CLEANUP], MaxLatency(us), 1891
[CLEANUP], 95thPercentileLatency(us), 1891
[CLEANUP], 99thPercentileLatency(us), 1891
total zerocopy send size = 0, total send size = 16542763, 0.000000
[OVERALL], RunTime(ms), 6095
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16406.890894175554
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 59.50242
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 5691
[READ], 95thPercentileLatency(us), 100
[READ], 99thPercentileLatency(us), 136
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1841.0
[CLEANUP], MinLatency(us), 1841
[CLEANUP], MaxLatency(us), 1841
[CLEANUP], 95thPercentileLatency(us), 1841
[CLEANUP], 99thPercentileLatency(us), 1841